# Task 1

### 1. Подключится к таблице _"tysql.sqlite"_

In [1]:
import sqlite3

com = sqlite3.connect('''C:/Users/UserT/Jupiter/tysql.sqlite''')
curs = com.cursor()

### 2. Вывести информацию про базу данных

In [2]:
curs.execute("SELECT * FROM sqlite_master where type='table'")
for i in curs.fetchall():
    print(*i)

table Customers Customers 2 CREATE TABLE Customers
(
  cust_id      char(10)  NOT NULL ,
  cust_name    char(50)  NOT NULL ,
  cust_address char(50)  NULL ,
  cust_city    char(50)  NULL ,
  cust_state   char(5)   NULL ,
  cust_zip     char(10)  NULL ,
  cust_country char(50)  NULL ,
  cust_contact char(50)  NULL ,
  cust_email   char(255) NULL ,
  PRIMARY KEY (cust_id)
)
table OrderItems OrderItems 4 CREATE TABLE OrderItems
(
  order_num  int          NOT NULL                      ,
  order_item int          NOT NULL                      ,
  prod_id    char(10)     NOT NULL                      ,
  quantity   int          NOT NULL                      ,
  item_price decimal(8,2) NOT NULL                      ,
  PRIMARY KEY (order_num, order_item)                   ,
  FOREIGN KEY (order_num) REFERENCES Orders (order_num) ,
  FOREIGN KEY (prod_id) REFERENCES Products (prod_id)
)
table Orders Orders 7 CREATE TABLE Orders
(
  order_num  int      NOT NULL ,
  order_date datetime NOT NULL ,
  cust_id    char(10) NOT NULL ,
  PRIMARY KEY (order_num)      ,
  FOREIGN KEY (cust_id) REFERENCES Customers (cust_id)
)
table Products Products 10 CREATE TABLE Products
(
  prod_id    char(10)      NOT NULL ,
  vend_id    char(10)      NOT NULL ,
  prod_name  char(255)     NOT NULL ,
  prod_price decimal(8,2)  NOT NULL ,
  prod_desc  text          NULL     ,
  PRIMARY KEY (prod_id)             ,
  FOREIGN KEY (vend_id) REFERENCES Vendors (vend_id)
)
table Vendors Vendors 12 CREATE TABLE Vendors
(
  vend_id      char(10) NOT NULL ,
  vend_name    char(50) NOT NULL ,
  vend_address char(50) NULL     ,
  vend_city    char(50) NULL     ,
  vend_state   char(5)  NULL     ,
  vend_zip     char(10) NULL     ,
  vend_country char(50) NULL     ,
  PRIMARY KEY (vend_id)
)

### Вывести список всех таблиц

In [4]:
curs.execute("SELECT name FROM sqlite_master where type='table'")
print(curs.fetchall())

[('Customers',), ('OrderItems',), ('Orders',), ('Products',), ('Vendors',)]

### Ознакомится со схемой базы данных

In [35]:
#curs.tables

# Task 2

### Список всех  _"cust_id"_   из таблицы _"Customers"_

In [16]:
curs.execute('SELECT cust_id FROM Customers')
for i in curs.fetchall():
    print(i)

('1000000001',)
('1000000002',)
('1000000003',)
('1000000004',)
('1000000005',)

### Вся таблица _"Customers"_

In [19]:
curs.execute('''SELECT *
FROM Customers''')
for i in curs.fetchall():
    print(i)

('1000000001', 'Village Toys', '200 Maple Lane', 'Detroit', 'MI', '44444', 'USA', 'John Smith', 'sales@villagetoys.com')
('1000000002', 'Kids Place', '333 South Lake Drive', 'Columbus', 'OH', '43333', 'USA', 'Michelle Green', None)
('1000000003', 'Fun4All', '1 Sunny Place', 'Muncie', 'IN', '42222', 'USA', 'Jim Jones', 'jjones@fun4all.com')
('1000000004', 'Fun4All', '829 Riverside Drive', 'Phoenix', 'AZ', '88888', 'USA', 'Denise L. Stephens', 'dstephens@fun4all.com')
('1000000005', 'The Toy Store', '4545 53rd Street', 'Chicago', 'IL', '54545', 'USA', 'Kim Howard', None)

### Список клиентов _("cust_id")_ отсортированный от Z  до A

In [31]:
curs.execute('''SELECT cust_name
FROM Customers 
ORDER BY cust_name DESC''')
for i in curs.fetchall():
    print(i)

('Village Toys',)
('The Toy Store',)
('Kids Place',)
('Fun4All',)
('Fun4All',)

### Таблица клиентов и заказов _("cust_id, order_num")_.   
#####    1. Сортировка по клиенту  
#####    2. Сортировка по дате заказа

In [46]:
curs.execute('''SELECT cust_id, order_num
FROM Customers, OrderItems
ORDER BY cust_id ASC, order_num ASC
''')
for i in curs.fetchall():
    print(i)

('1000000001', 20005)
('1000000001', 20005)
('1000000001', 20006)
('1000000001', 20006)
('1000000001', 20006)
('1000000001', 20007)
('1000000001', 20007)
('1000000001', 20007)
('1000000001', 20007)
('1000000001', 20007)
('1000000001', 20008)
('1000000001', 20008)
('1000000001', 20008)
('1000000001', 20008)
('1000000001', 20008)
('1000000001', 20009)
('1000000001', 20009)
('1000000001', 20009)
('1000000002', 20005)
('1000000002', 20005)
('1000000002', 20006)
('1000000002', 20006)
('1000000002', 20006)
('1000000002', 20007)
('1000000002', 20007)
('1000000002', 20007)
('1000000002', 20007)
('1000000002', 20007)
('1000000002', 20008)
('1000000002', 20008)
('1000000002', 20008)
('1000000002', 20008)
('1000000002', 20008)
('1000000002', 20009)
('1000000002', 20009)
('1000000002', 20009)
('1000000003', 20005)
('1000000003', 20005)
('1000000003', 20006)
('1000000003', 20006)
('1000000003', 20006)
('1000000003', 20007)
('1000000003', 20007)
('1000000003', 20007)
('1000000003', 20007)
('1000000003', 20007)
('1000000003', 20008)
('1000000003', 20008)
('1000000003', 20008)
('1000000003', 20008)
('1000000003', 20008)
('1000000003', 20009)
('1000000003', 20009)
('1000000003', 20009)
('1000000004', 20005)
('1000000004', 20005)
('1000000004', 20006)
('1000000004', 20006)
('1000000004', 20006)
('1000000004', 20007)
('1000000004', 20007)
('1000000004', 20007)
('1000000004', 20007)
('1000000004', 20007)
('1000000004', 20008)
('1000000004', 20008)
('1000000004', 20008)
('1000000004', 20008)
('1000000004', 20008)
('1000000004', 20009)
('1000000004', 20009)
('1000000004', 20009)
('1000000005', 20005)
('1000000005', 20005)
('1000000005', 20006)
('1000000005', 20006)
('1000000005', 20006)
('1000000005', 20007)
('1000000005', 20007)
('1000000005', 20007)
('1000000005', 20007)
('1000000005', 20007)
('1000000005', 20008)
('1000000005', 20008)
('1000000005', 20008)
('1000000005', 20008)
('1000000005', 20008)
('1000000005', 20009)
('1000000005', 20009)
('1000000005', 20009)

### Таблица количества и стоимости товара.  
#### Сортировка по убыванию

In [57]:
curs.execute('''SELECT quantity, item_price
FROM OrderItems
ORDER BY quantity DESC, item_price DESC
''')
for i in curs.fetchall():
    print(i)

(250, 2.49)
(250, 2.49)
(250, 2.49)
(100, 10.99)
(100, 5.49)
(100, 2.99)
(100, 2.99)
(100, 2.99)
(50, 11.49)
(50, 4.49)
(20, 5.99)
(10, 11.99)
(10, 8.99)
(10, 3.49)
(10, 3.49)
(10, 3.49)
(5, 11.99)
(5, 4.99)

### Товар из таблицы _"Products"_ , цена которого равна 9.49.

In [4]:
curs.execute('''SELECT prod_name
FROM Products
WHERE prod_price = 9.49
''')
for i in curs.fetchall():
    print(i)

('King doll',)
('Queen doll',)

### Название товара и цена в диапазоне от 3 до 6.
* **сортировка по цене в порядке возрастания**

In [40]:
curs.execute('''SELECT prod_name, prod_price
FROM Products
WHERE prod_price > 3 and prod_price < 6 
ORDER BY prod_price''')
for i in curs.fetchall():
    print(i)
    
# WHERE prod_price BETWEEN 3 and 6

('Fish bean bag toy', 3.49)
('Bird bean bag toy', 3.49)
('Rabbit bean bag toy', 3.49)
('Raggedy Ann', 4.99)
('8 inch teddy bear', 5.99)

# Task 3

### Количество проданного товара

In [15]:
curs.execute('''SELECT SUM(quantity)
FROM OrderItems
Group BY prod_id''')

for i in curs.fetchall():
    print(i)

(360,)
(360,)
(360,)
(120,)
(10,)
(165,)
(55,)

### Количество наименований товара, цена которого больше 4

In [19]:
curs.execute('''SELECT prod_name
FROM Products
WHERE prod_price > 4
''')

for i in curs.fetchall():
    print(i)

('8 inch teddy bear',)
('12 inch teddy bear',)
('18 inch teddy bear',)
('Raggedy Ann',)
('King doll',)
('Queen doll',)

### Алгоритм выведения 3 самых дорогих товаров

In [22]:
curs.execute('''SELECT prod_name, prod_price
FROM Products
ORDER BY prod_price DESC
LIMIT 3
''')

for i in curs.fetchall():
    print(i)

('18 inch teddy bear', 11.99)
('King doll', 9.49)
('Queen doll', 9.49)

### Количество заказов каждого клиента

In [30]:
curs.execute('''SELECT cust_id, COUNT(order_num)
FROM Orders
GROUP BY cust_id
''')

for i in curs.fetchall():
    print(i)

('1000000001', 2)
('1000000003', 1)
('1000000004', 1)
('1000000005', 1)

In [33]:
curs.execute('''SELECT cust_id, (SELECT COUNT(order_num) FROM Orders t1 WHERE t1.cust_id = t2.cust_id)
FROM Orders t2
GROUP BY cust_id
''')

for i in curs.fetchall():
    print(i)

('1000000001', 2)
('1000000003', 1)
('1000000004', 1)
('1000000005', 1)

### Список клиентов и их заказы

In [34]:
curs.execute('''SELECT Customers.cust_name, Orders.order_num
FROM Orders
JOIN Customers on Orders.cust_id = Customers.cust_id
''')

for i in curs.fetchall():
    print(i)

('Village Toys', 20005)
('Fun4All', 20006)
('Fun4All', 20007)
('The Toy Store', 20008)
('Village Toys', 20009)

### Два запроса:  
* список товаров(цена меньше 5)  
* список товаров(цена больше или равна 5)

In [12]:
curs.execute('''SELECT prod_name, prod_price
FROM Products
WHERE prod_price < 5
UNION
SELECT prod_name, prod_price
FROM Products
WHERE prod_price >= 5
''')

for i in curs.fetchall():
    print(i)

('12 inch teddy bear', 8.99)
('18 inch teddy bear', 11.99)
('8 inch teddy bear', 5.99)
('Bird bean bag toy', 3.49)
('Fish bean bag toy', 3.49)
('King doll', 9.49)
('Queen doll', 9.49)
('Rabbit bean bag toy', 3.49)
('Raggedy Ann', 4.99)

### Вывести товар с наибольшей и наименьшей ценой

In [22]:
curs.execute('''SELECT prod_name, MAX(prod_price)
FROM Products
UNION
SELECT prod_name, MIN(prod_price)
FROM Products
''')

for i in curs.fetchall():
    print(i)

('18 inch teddy bear', 11.99)
('Fish bean bag toy', 3.49)

In [25]:
curs.execute('''SELECT *
FROM (SELECT prod_name, prod_price FROM Products ORDER BY prod_price DESC LIMIT 3)
UNION
SELECT *
FROM (SELECT prod_name, prod_price FROM Products ORDER BY prod_price  LIMIT 3)
''')


for i in curs.fetchall():
    print(i)

('18 inch teddy bear', 11.99)
('Bird bean bag toy', 3.49)
('Fish bean bag toy', 3.49)
('King doll', 9.49)
('Queen doll', 9.49)
('Rabbit bean bag toy', 3.49)

In [21]:
curs.execute('''SELECT prod_name, prod_price
FROM Products
WHERE prod_price = (SELECT MIN(prod_price) FROM Products) 
''')

for i in curs.fetchall():
    print(i)

('Fish bean bag toy', 3.49)
('Bird bean bag toy', 3.49)
('Rabbit bean bag toy', 3.49)

In [20]:
curs.execute('''SELECT order_num, SUM(quantity)
FROM OrderItems
GROUP BY order_num
HAVING SUM(quantity) > 50 
''')

for i in curs.fetchall():
    print(i)

(20005, 200)
(20007, 400)
(20009, 750)